; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c4-s3-p8-a2-neargoal-d14)
(:domain logistics-strips)
(:objects a0 a1 c0 c1 c2 c3 t0 t1 t2 t3 l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 l3-0 l3-1 l3-2 p0 p1 p2 p3 p4 p5 p6 p7)
(:init
(AIRPLANE a0)
(AIRPLANE a1)
(AIRPORT l0-0)
(AIRPORT l1-0)
(AIRPORT l2-0)
(AIRPORT l3-0)
(CITY c0)
(CITY c1)
(CITY c2)
(CITY c3)
(LOCATION l0-0)
(LOCATION l0-1)
(LOCATION l0-2)
(LOCATION l1-0)
(LOCATION l1-1)
(LOCATION l1-2)
(LOCATION l2-0)
(LOCATION l2-1)
(LOCATION l2-2)
(LOCATION l3-0)
(LOCATION l3-1)
(LOCATION l3-2)
(OBJ p0)
(OBJ p1)
(OBJ p2)
(OBJ p3)
(OBJ p4)
(OBJ p5)
(OBJ p6)
(OBJ p7)
(TRUCK t0)
(TRUCK t1)
(TRUCK t2)
(TRUCK t3)
(at a0 l1-0)
(at a1 l0-0)
(at p0 l0-0)
(at p1 l3-1)
(at p2 l2-2)
(at p3 l0-1)
(at p4 l0-0)
(at p7 l0-0)
(at t0 l0-1)
(at t1 l1-0)
(at t2 l2-2)
(at t3 l3-0)
(in p5 a1)
(in p6 a1)
(in-city l0-0 c0)
(in-city l0-1 c0)
(in-city l0-2 c0)
(in-city l1-0 c1)
(in-city l1-1 c1)
(in-city l1-2 c1)
(in-city l2-0 c2)
(in-city l2-1 c2)
(in-city l2-2 c2)
(in-city l3-0 c3)
(in-city l3-1 c3)
(in-city l3-2 c3)
)
(:goal (and
(at p0 l0-1)
(at p1 l3-1)
(at p2 l2-2)
(at p3 l0-1)
(at p4 l0-0)
(at p5 l1-2)
(at p6 l3-1)
(at p7 l0-0)
))
)

; plan
1. (fly-airplane a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 5 of 8
2. (unload-airplane p5 a1 l1-0)
   deleted: (in p5 a1)
   added: (at p5 l1-0)
   goals met: 5 of 8
3. (load-truck p5 t1 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 t1)
   goals met: 5 of 8
4. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 5 of 8
5. (unload-truck p5 t1 l1-2)
   deleted: (in p5 t1)
   added: (at p5 l1-2)
   goals met: 6 of 8
6. (fly-airplane a1 l1-0 l3-0)
   deleted: (at a1 l1-0)
   added: (at a1 l3-0)
   goals met: 6 of 8
7. (unload-airplane p6 a1 l3-0)
   deleted: (in p6 a1)
   added: (at p6 l3-0)
   goals met: 6 of 8
8. (load-truck p6 t3 l3-0)
   deleted: (at p6 l3-0)
   added: (in p6 t3)
   goals met: 6 of 8
9. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 6 of 8
10. (unload-truck p6 t3 l3-1)
   deleted: (in p6 t3)
   added: (at p6 l3-1)
   goals met: 7 of 8
11. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 7 of 8
12. (load-truck p0 t0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 t0)
   goals met: 7 of 8
13. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 7 of 8
14. (unload-truck p0 t0 l0-1)
   deleted: (in p0 t0)
   added: (at p0 l0-1)
   goals met: 8 of 8
